#+STARTUP: content
#+STARTUP: indent
#+STARTUP: hidestars
***  Org 写 PPT
   :LOGBOOK:
   - State "OKTODAY"    from "STARTED"    [2014-05-09 五 14:37]
   - State "OKTODAY"    from "STARTED"    [2014-05-07 三 19:12]
   CLOCK: [2014-05-09 五 15:37]--[2014-05-09 五 16:04] =>  0:27
   CLOCK: [2014-05-09 五 14:09]--[2014-05-09 五 14:24] =>  0:15
   CLOCK: [2014-05-07 三 17:44]--[2014-05-07 三 19:12] =>  1:28
   :END:
 
  - http://orgmode.org/worg/org-tutorials/non-beamer-presentations.html#sec-3
  - https://github.com/yjwen/org-reveal/blob/master/Readme.org  
  - http://forum.ubuntu.org.cn/viewtopic.php?t=810
  - http://orgmode.org/manual/Beamer-export.html
  - http://orgmode.org/worg/exporters/beamer/ox-beamer.html
  - https://github.com/fniessen/refcard-org-beamer
  - http://orgmode.org/worg/exporters/beamer/ox-beamer.htmlhttp://orgmode.org/worg/exporters/beamer/ox-beamer.html
sudo apt-get install texlive-fonts-recommended
sudo apt-get install texlive cjk-latex latex-cjk-all latex-beamer
#+BEGIN_SRC emacs-lisp
(setq org-latex-coding-system 'utf-8)
;;; Export language
(setq org-export-default-language "zh-CN")
(eval-after-load "ox-latex"

  ;; update the list of LaTeX classes and associated header (encoding, etc.)
  ;; and structure
  '(add-to-list 'org-latex-classes
                `("beamer"
                  ,(concat "\\documentclass[presentation]{beamer}\n"
                           "[DEFAULT-PACKAGES]"
                           "[PACKAGES]"
                           "[EXTRA]\n")
                  ("\\section{%s}" . "\\section*{%s}")
                  ("\\subsection{%s}" . "\\subsection*{%s}")
                  ("\\subsubsection{%s}" . "\\subsubsection*{%s}"))))
#+END_SRC

*** DONE Evil  
CLOSED: [2014-12-26 Fri 08:49]
:LOGBOOK:  
- State "DONE"       from "WAITING"    [2014-12-26 Fri 08:49]
- State "WAITING"    from "STARTED"    [2014-12-22 Mon 13:28]
CLOCK: [2014-12-22 Mon 11:25]--[2014-12-22 Mon 13:28] =>  2:03
:END:      
** DONE 根据 org-clock.el中的 org-clocktable-write-default 编写自己的fomater
CLOSED: [2014-06-03 二 10:47]
:LOGBOOK:
- State "DONE"       from "STARTED"    [2014-06-03 二 10:47]
CLOCK: [2014-06-03 二 10:04]--[2014-06-03 二 10:47] =>  0:43
:END:

** TODO [#C] 邮件(mutt)
:LOGBOOK:
CLOCK: [2014-05-13 二 11:00]--[2014-05-13 二 11:12] =>  0:12
:END:

  1. http://docs.huihoo.com/homepage/shredderyin/mutt_frame.html
  2. http://heim.ifi.uio.no/~jani/mutt/muttemacs.html
  3. http://emacs-fu.blogspot.com/2009/01/e-mail-with-emacs-using-mutt.html
  4. http://upsilon.cc/~zack/blog/posts/2010/02/integrating_Mutt_with_Org-mode/
  5. http://wenshanren.org/?p=111

mu4e

#+BEGIN_SRC 
sudo apt-get install libgmime-2.6-dev libxapian-dev gnutls-bin
sudo apt-get install guile-2.0-dev html2text xdg-utils
git clone https://github.com/djcb/mu.git
#+END_SRC

emacs-conf.sample :

#+BEGIN_SRC
;; standard org <-> remember stuff, RTFM
(require 'org-capture)
(require 'org-protocol)

(setq org-default-notes-file "~/org/gtd.org")

(setq org-capture-templates
      (quote
       (("m"
         "Mail"
         entry
         (file+headline "~/org/gtd.org" "Incoming")
         "* TODO %^{Title}\n\n  Source: %u, %c\n\n  %i"
         :empty-lines 1)
        ;; ... more templates here ...
        )))
;; ensure that emacsclient will show just the note to be edited when invoked
;; from Mutt, and that it will shut down emacsclient once finished;
;; fallback to legacy behavior when not invoked via org-protocol.
(add-hook 'org-capture-mode-hook 'delete-other-windows)
(setq my-org-protocol-flag nil)
(defadvice org-capture-finalize (after delete-frame-at-end activate)
  "Delete frame at remember finalization"
  (progn (if my-org-protocol-flag (delete-frame))
         (setq my-org-protocol-flag nil)))
(defadvice org-capture-kill (after delete-frame-at-end activate)
  "Delete frame at remember abort"
  (progn (if my-org-protocol-flag (delete-frame))
         (setq my-org-protocol-flag nil)))
(defadvice org-protocol-capture (before set-org-protocol-flag activate)
  (setq my-org-protocol-flag t))

(defun open-mail-in-mutt (message)
  "Open a mail message in Mutt, using an external terminal.

Message can be specified either by a path pointing inside a
Maildir, or by Message-ID."
  (interactive "MPath or Message-ID: ")
  (shell-command
   (format "gnome-terminal -e \"%s %s\""
           (substitute-in-file-name "$HOME/bin/mutt-open") message)))

;; add support for "mutt:ID" links
(org-add-link-type "mutt" 'open-mail-in-mutt)
#+END_SRC

mutt-conf.sample:

#+BEGIN_SRC
macro index \eR "|~/bin/remember-mail\n"
#+END_SRC

mutt-open
